perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/api_servers'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    - name: End
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'
      - get:
          url: '/proxy_9090'
      - get:
          url: '/proxy_9091'
      - get:
          url: '/heavy'